FemDesign.Bars.BarPart
bar_part_type
Underlying representation of a Bar-element.

FemDesign.Bars.BarPart._edge
Edge field

FemDesign.Bars.BarPart.Edge
Edge property

FemDesign.Bars.BarPart._name
Identifier field

FemDesign.Bars.BarPart.Name
Identifier property

FemDesign.Bars.BarPart._complexMaterialObj
Material field

FemDesign.Bars.BarPart.ComplexMaterialObj
Material property. When a new material is set the ComplexMaterialRef is updated.

FemDesign.Bars.BarPart.#ctor
Parameterless constructor for serialization.

FemDesign.Bars.BarPart.#ctor(FemDesign.Geometry.Edge,FemDesign.Bars.BarType,FemDesign.Materials.Material,FemDesign.Sections.Section,FemDesign.Bars.Eccentricity,FemDesign.Bars.Connectivity,System.String)
Construct beam or column with uniform section and uniform start/end conditions.

FemDesign.Bars.BarPart.#ctor(FemDesign.Geometry.Edge,FemDesign.Bars.BarType,FemDesign.Materials.Material,FemDesign.Sections.Section,FemDesign.Bars.Eccentricity,FemDesign.Bars.Eccentricity,FemDesign.Bars.Connectivity,FemDesign.Bars.Connectivity,System.String)
Construct beam or column with uniform section and different start/end conditions.

FemDesign.Bars.BarPart.#ctor(FemDesign.Geometry.Edge,FemDesign.Bars.BarType,FemDesign.Materials.Material,FemDesign.Sections.Section,FemDesign.Sections.Section,FemDesign.Bars.Eccentricity,FemDesign.Bars.Eccentricity,FemDesign.Bars.Connectivity,FemDesign.Bars.Connectivity,System.String)
Construct beam or column with start/end section and different start/end conditions

FemDesign.Bars.BarPart.#ctor(FemDesign.Geometry.Edge,FemDesign.Bars.BarType,FemDesign.Materials.Material,FemDesign.Sections.Section[],FemDesign.Bars.Eccentricity[],FemDesign.Bars.Connectivity[],System.String)
Construct beam or column with non-uniform section and start/end conditions

FemDesign.Bars.BarPart.#ctor(FemDesign.Geometry.Edge,FemDesign.Bars.BarType,FemDesign.Materials.Material,FemDesign.Sections.Section[],System.Double[],FemDesign.Bars.Eccentricity[],FemDesign.Bars.Connectivity,FemDesign.Bars.Connectivity,System.String)
Construct beam or column with non-uniform section and start/end conditions